mariopartyrd/marioparty4/src/REL/m455Dll/main.c
#include "game/disp.h"
#include "game/hu3d.h"
#include "game/object.h"
#include "game/objsub.h"

#include "game/pad.h"

#include "REL/m455Dll.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/frand.h"
#include "game/gamework_data.h"
#include "game/minigame_seq.h"
#include "game/wipe.h"

#include "ext_math.h"
#include "math.h"
#include "version.h"
#include <string.h>

#ifndef __MWERKS__
#include "game/esprite.h"
#include "game/hsfex.h"
#endif

typedef struct camera_view_params {
    float zoom;
    Vec pos;
    Vec rot;
} CameraViewParams;

CameraViewParams lbl_1_data_0[2] = { { 500, { 0, 1000, 0 }, { 40, 0, 0 } }, { 1985, { 0, 300, 0 }, { -6, 0, 0 } } };
Vec lbl_1_data_38 = { 700, 2500, -700 };
Vec lbl_1_data_44 = { 0, 0, 0 };
GXColor lbl_1_data_50 = { 255, 255, 255, 255 };
Vec lbl_1_data_54 = { 200, 15000, -200 };
Vec lbl_1_data_60 = { 0, 1, 0 };

OMOBJ *lbl_1_bss_40;
OMOBJ *lbl_1_bss_3C;
OMOBJ *lbl_1_bss_38;
s32 lbl_1_bss_34;
s32 lbl_1_bss_30;
s32 lbl_1_bss_2C;
s32 lbl_1_bss_28;
s16 lbl_1_bss_26;
s16 lbl_1_bss_24;
s16 lbl_1_bss_22;
s16 lbl_1_bss_20;
s16 lbl_1_bss_18[4];
s16 lbl_1_bss_16;
s16 lbl_1_bss_14;
#if VERSION_PAL
s32 lbl_1_bss_pal;
#endif
Vec lbl_1_bss_8;
s16 lbl_1_bss_4;
s32 lbl_1_bss_0;

void fn_1_330(OMOBJ *object);
void fn_1_B94(HUPROCESS *objman);
void fn_1_2A90(HUPROCESS *objman);
s32 fn_1_3214(void);

void ObjectSetup(void)
{
    HUPROCESS *objman;
    HU3DCAMERA *camera = &Hu3DCamera[0];
    s16 light;
    OSReport("******* M455ObjectSetup *********\n");
    objman = omInitObjMan(50, 8192);
    omGameSysInit(objman);
    Hu3DCameraCreate(HU3D_CAM0);
    Hu3DCameraPerspectiveSet(HU3D_CAM0, -1, 20, 25000, 1.2f);
    Hu3DCameraViewportSet(HU3D_CAM0, 0, 0, 640, 480, 0, 1);
    lbl_1_bss_3C = omAddObjEx(objman, 32730, 0, 0, -1, omOutView);
    lbl_1_bss_8.x = lbl_1_data_44.x - lbl_1_data_38.x;
    lbl_1_bss_8.y = lbl_1_data_44.y - lbl_1_data_38.y;
    lbl_1_bss_8.z = lbl_1_data_44.z - lbl_1_data_38.z;
    VECNormalize(&lbl_1_bss_8, &lbl_1_bss_8);
    light = Hu3DGLightCreateV(&lbl_1_data_38, &lbl_1_bss_8, &lbl_1_data_50);
    Hu3DGLightInfinitytSet(light);
    Hu3DGLightStaticSet(light, 1);
    Hu3DShadowCreate(10, camera->near, camera->far);
    Hu3DShadowTPLvlSet(0.7f);
    Hu3DShadowPosSet(&lbl_1_data_54, &lbl_1_data_60, &lbl_1_data_44);
    HuAudSndGrpSet(77);
    lbl_1_bss_38 = omAddObjEx(objman, 0, 0, 0, -1, fn_1_330);
    fn_1_2A90(objman);
    fn_1_B94(objman);
    fn_1_32C4(objman);
}

void fn_1_310(s32 arg0)
{
    lbl_1_bss_34 = arg0;
}

s32 fn_1_320(void)
{
    return lbl_1_bss_34;
}

void fn_1_478(OMOBJ *object);

void fn_1_330(OMOBJ *object)
{
    HU3DCAMERA *camera = &Hu3DCamera[0];
    lbl_1_bss_34 = 0;
    lbl_1_bss_2C = REFRESH_RATE;
    lbl_1_bss_30 = -1;
    lbl_1_bss_26 = 30;
    lbl_1_bss_24 = REFRESH_RATE;
    lbl_1_bss_22 = -1;
    lbl_1_bss_20 = 0;
    lbl_1_bss_16 = ((frand16() * (REFRESH_RATE_F * 4.5f)) / 65536.0f) + (REFRESH_RATE_F / 2);
    WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 60);
    camera->fov = 30.0f;
    object->objFunc = fn_1_478;
}

void fn_1_B38(OMOBJ *object);
void fn_1_C28(void);
s32 fn_1_C90(void);

typedef struct m455_player {
    u8 field0 : 1;
    u8 field1 : 1;
    u8 field2 : 1;
    s16 unk2;
    s16 unk4;
    s8 unk6;
    s8 unk7;
    u16 unk8;
    u16 unkA;
    s32 unkC;
    s16 unk10;
    s16 unk12;
    s16 unk14;
    s16 unk16;
    s32 unk18;
    s32 unk1C;
    u32 unk20;
    s16 unk24;
    s16 unk26;
    s16 unk28;
    s16 unk2A;
    s16 unk2C;
    s16 unk2E;
    s16 unk30;
    Vec unk34[2];
    Vec unk4C;
    s16 unk58;
    s32 unk5C[4];
} M455Player;

s16 lbl_1_data_90 = -1;
s32 lbl_1_data_94 = -1;
s32 lbl_1_data_98 = -1;

void fn_1_478(OMOBJ *object)
{
    s32 i;
    OMOBJ **playerList;
    M455Player *player;

    switch (fn_1_320()) {
        case 0:
            if (lbl_1_data_98 < 0) {
                lbl_1_data_98 = HuAudFXPlay(1985);
            }
            if (--lbl_1_bss_2C == 0) {
                fn_1_310(1);
                lbl_1_bss_2C = REFRESH_RATE * 2;
            }
            break;

        case 1:
            if (--lbl_1_bss_2C == 0) {
                fn_1_310(2);
                lbl_1_bss_4 = MGSeqStartCreate();
            }
            break;

        case 2:
            if (!MGSeqStatGet(lbl_1_bss_4)) {
                fn_1_310(3);
            }
            if (lbl_1_data_94 < 0 && (MGSeqStatGet(lbl_1_bss_4) & 0x10)) {
                lbl_1_data_94 = HuAudSeqPlay(60);
            }
            break;

        case 3:
            if (--lbl_1_bss_24 == 0) {
                lbl_1_bss_26--;
                if (lbl_1_data_90 >= 0) {
                    MGSeqParamSet(lbl_1_data_90, 1, lbl_1_bss_26);
                }
                lbl_1_bss_24 = REFRESH_RATE;
                if (lbl_1_bss_26 == 10) {
                    lbl_1_data_90 = MGSeqTimerCreate(10);
                }
            }
            if (lbl_1_bss_16 >= 0) {
                lbl_1_bss_16--;
            }
            if (lbl_1_bss_26 == 0 || fn_1_C90()) {
                fn_1_310(4);
                lbl_1_bss_4 = MGSeqFinishCreate();
                HuAudSeqFadeOut(lbl_1_data_94, 100);
            }
            break;

        case 4:
            if (lbl_1_data_90 >= 0) {
                MGSeqParamSet(lbl_1_data_90, 2, -1);
                lbl_1_data_90 = -1;
            }
            if (!MGSeqStatGet(lbl_1_bss_4)) {
                fn_1_310(7);
                lbl_1_bss_2C = REFRESH_RATE * 2;
            }
            break;

        case 7:
            if (--lbl_1_bss_2C == 0) {
                fn_1_310(9);
                if (lbl_1_bss_30 >= 0) {
                    HuAudSStreamPlay(1);
                    playerList = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
                    for (i = 0; i < 4; i++) {
                        player = playerList[i]->data;
                        if (player->unk28 < 0) {
                            GWPlayerCoinWinSet(i, lbl_1_bss_22 + 1);
                        }
                    }
                }
                else {
                    HuAudSStreamPlay(4);
                    for (i = 0; i < 4; i++) {
                        GWPlayerCoinWinSet(i, 3);
                    }
                }
                lbl_1_bss_2C = REFRESH_RATE * 3.5;
            }
            break;

        case 9:
            if (--lbl_1_bss_2C == 0) {
                WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
                HuAudFXStop(lbl_1_data_98);
                object->objFunc = fn_1_B38;
            }
            break;
    }
    if (lbl_1_bss_20) {
        if (lbl_1_bss_20 >= 2) {
            for (i = 0; i < 100; i++) {
                s32 srcIdx = (frand8() * lbl_1_bss_20) >> 8;
                s32 dstIdx = (frand8() * lbl_1_bss_20) >> 8;
                s32 temp = lbl_1_bss_18[srcIdx];
                lbl_1_bss_18[srcIdx] = lbl_1_bss_18[dstIdx];
                lbl_1_bss_18[dstIdx] = temp;
            }
        }
        playerList = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
        for (i = 0; i < lbl_1_bss_20; i++) {
            lbl_1_bss_22++;
            GWPlayerCoinWinSet(lbl_1_bss_18[i], lbl_1_bss_22);
            player = playerList[lbl_1_bss_18[i]]->data;
            player->unk28 = lbl_1_bss_22;
        }
        lbl_1_bss_20 = 0;
    }
    if (omSysExitReq && !WipeStatGet()) {
        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
        object->objFunc = fn_1_B38;
    }
}

void fn_1_B38(OMOBJ *object)
{
    if (WipeStatGet()) {
        return;
    }
    fn_1_C28();
    fn_1_340C();
    MGSeqKillAll();
    HuAudFadeOut(1);
    omOvlReturnEx(1, 1);
    OSReport("******* M455Exit *********\n");
}

