mariopartyrd/marioparty4/src/REL/m455Dll/main.c
void fn_1_D14(OMOBJ *object);

void fn_1_B94(HUPROCESS *objman)
{
    s32 i;
    lbl_1_bss_28 = 0;
    lbl_1_bss_14 = 3;
#if VERSION_PAL
    lbl_1_bss_pal = fn_1_3214();
#endif
    omMakeGroupEx(objman, 0, 4);
    for (i = 0; i < 4; i++) {
        omAddObjEx(objman, 5, 10, 50, 0, fn_1_D14);
    }
}

void fn_1_2010(OMOBJ *object);

void fn_1_C28(void)
{
    s32 i;
    OMOBJ **playerList;
    playerList = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    if (playerList == NULL) {
        return;
    }
    for (i = 0; i < 4; i++) {
        fn_1_2010(playerList[i]);
    }
}

s32 fn_1_C90(void)
{
    s32 i;
    OMOBJ **playerList;
    playerList = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    for (i = 0; i < 4; i++) {
        M455Player *player = playerList[i]->data;
        if (!player->field1) {
            return 0;
        }
    }
    return 1;
}

u32 lbl_1_data_E0[5][2] = {
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x00),
    0,
    0x540024,
    1,
    0x54001C,
    1,
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x17),
    0,
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x18),
    0,
};

Vec lbl_1_data_108[4] = {
    { -300, 0, -100 },
    { -100, 0, -100 },
    { 100, 0, -100 },
    { 300, 0, -100 },
};

void fn_1_1444(OMOBJ *object);

void fn_1_2060(HU3DMODEL *arg0, Mtx arg1);

void fn_1_D14(OMOBJ *object)
{
    M455Player *player;
    s32 charNo;
    u32 i;
    player = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(M455Player), MEMORY_DEFAULT_NUM);
    object->data = player;
    memset(player, 0, sizeof(M455Player));
    player->unk2 = lbl_1_bss_28++;
    player->unk4 = GWPlayerCfg[player->unk2].pad_idx;
#if VERSION_PAL
    player->unkC = lbl_1_bss_pal;
#else
    player->unkC = fn_1_3214();
#endif
    charNo = GWPlayerCfg[player->unk2].character;
    player->unk10 = charNo;
    player->unk12 = GWPlayerCfg[player->unk2].diff;
    player->unk14 = GWPlayerCfg[player->unk2].group;
    object->mdlId[0] = CharModelCreate(charNo, 8);
    Hu3DModelShadowSet(object->mdlId[0]);
    Hu3DModelLayerSet(object->mdlId[0], 3);
    Hu3DModelCameraSet(object->mdlId[0], HU3D_CAM0);
    object->mdlId[1] = Hu3DModelCreateFile(0x540002);
    Hu3DModelHookSet(object->mdlId[0], "test11_tex_we-itemhook-r", object->mdlId[1]);
    Hu3DModelAttrSet(object->mdlId[1], HU3D_MOTATTR_SHAPE_PAUSE | HU3D_MOTATTR_PAUSE);
    player->unk1C = 1;
    for (i = 0; i < 5; i++) {
        if (lbl_1_data_E0[i][1] == 0) {
            object->mtnId[i] = CharMotionCreate(player->unk10, lbl_1_data_E0[i][0]);
        }
        else {
            object->mtnId[i] = CharMotionCreate(player->unk10, player->unk10 + lbl_1_data_E0[i][0]);
        }
    }
    Hu3DMotionSet(object->mdlId[0], object->mtnId[player->unk1C]);
    Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
    object->trans.x = lbl_1_data_108[player->unk2].x;
    object->trans.y = lbl_1_data_108[player->unk2].y;
    object->trans.z = lbl_1_data_108[player->unk2].z;
    player->unk2A = espEntry(0x54000C, 0x8000, 0);
    espDispOff(player->unk2A);
    object->mdlId[3] = Hu3DHookFuncCreate(fn_1_2060);
    Hu3DModelLayerSet(object->mdlId[3], 3);
    Hu3DModelCameraSet(object->mdlId[3], HU3D_CAM0);
    Hu3DData[object->mdlId[3]].hookData = object;
    object->mdlId[4] = Hu3DModelCreateFile(0x54000A);
    Hu3DModelLayerSet(object->mdlId[4], 3);
    Hu3DModelCameraSet(object->mdlId[4], HU3D_CAM0);
    Hu3DModelShadowSet(object->mdlId[4]);
    i = Hu3DMotionCreateFile(0x54000B);
    Hu3DMotionSet(object->mdlId[4], i);
    Hu3DModelAttrSet(object->mdlId[4], HU3D_MOTATTR_LOOP);
    Hu3DModelAttrSet(object->mdlId[4], HU3D_MOTATTR_PAUSE);
    player->unk4C.x = object->trans.x + (50.0f * ((((s32)frand() & 0x1FF) - 256.0f) / 256.0f));
    player->unk4C.y = -200;
    player->unk4C.z = -1500;
    Hu3DModelPosSetV(object->mdlId[4], &player->unk4C);
    Hu3DModelAttrSet(object->mdlId[4], HU3D_ATTR_DISPOFF);
    player->unk34[0].x = object->trans.x;
    player->unk34[0].y = 0;
    player->unk34[0].z = -500;
    player->unk34[1].x = object->trans.x;
    player->unk34[1].y = -200;
    player->unk34[1].z = -1000;
    CharModelDataClose(player->unk10);
    object->rot.y = 180;
    if (((s32)frand() & 0x1F) < 4 - player->unk12) {
        player->unk58 = lbl_1_bss_16 - (REFRESH_RATE_F * (0.05f * (4 - player->unk12))) - ((frand8() / 256.0f) * (REFRESH_RATE_F / 10));
        if (player->unk58 < 0) {
            player->unk58 = 0;
        }
    }
    else {
        player->unk58 = lbl_1_bss_16 + (REFRESH_RATE_F * (0.1f * (4 - player->unk12))) + ((frand8() / 256.0f) * (REFRESH_RATE_F / 2)) + (REFRESH_RATE_F / 10);
    }
    player->unk28 = -1;
    object->objFunc = fn_1_1444;
}

void fn_1_1400(OMOBJ *object)
{
    M455Player *player = object->data;
    if (player->unk58 != 0) {
        player->unk58--;
    }
    else {
        player->unkA |= PAD_BUTTON_A;
    }
}

float lbl_1_data_154[4] = { -350, -170, 170, 350 };

float lbl_1_data_164[3] = { 1.5f, 1.0f, 0.5f };

float fn_1_2390(float arg0, float arg1, float arg2);
s32 fn_1_24F0(Vec *arg0, Vec *arg1, float arg2);

void fn_1_1444(OMOBJ *object)
{
    M455Player *temp_r31;
    s32 temp_r29;
    u32 temp_r28;
    Vec sp24[3];
    Vec sp18;
    Vec spC;
    float temp_f31;

    temp_r31 = object->data;
    temp_r29 = temp_r31->unk1C;
    temp_r28 = temp_r31->unk20;
    object->trans.y = fn_1_687C();
    if (fn_1_320() < 3) {
        return;
    }
    switch (temp_r31->unk16) {
        case 0:
            if (fn_1_320() == 4 || lbl_1_bss_14 == 0) {
                temp_r31->field1 = 1;
                temp_r31->unk16 = 2;
                espDispOff(temp_r31->unk2A);
                return;
            }
            if (!GWPlayerCfg[temp_r31->unk2].iscom) {
                temp_r31->unk6 = HuPadStkX[temp_r31->unk4];
                temp_r31->unk7 = HuPadStkY[temp_r31->unk4];
                temp_r31->unk8 = HuPadBtn[temp_r31->unk4];
                temp_r31->unkA = HuPadBtnDown[temp_r31->unk4];
            }
            else {
                temp_r31->unk8 = temp_r31->unkA = 0;
                temp_r31->unk6 = temp_r31->unk7 = 0;
                fn_1_1400(object);
            }
            if (lbl_1_bss_16 == 0) {
                if (temp_r31->unkC) {
                    omVibrate(temp_r31->unk2, 12, 12, 0);
                }
                else {
                    sp18.x = object->trans.x;
                    sp18.y = object->trans.y + 300;
                    sp18.z = object->trans.z;
                    Hu3D3Dto2D(&sp18, HU3D_CAM0, &sp18);
                    espPosSet(temp_r31->unk2A, sp18.x, sp18.y);
                    espDispOn(temp_r31->unk2A);
                    temp_r31->unk30 = 0;
                }
                temp_r31->unk2C = temp_r31->unk2E = REFRESH_RATE / 2;
            }

            if (temp_r31->unkA & PAD_BUTTON_A) {
                temp_r31->unk16 = 1;
                temp_r31->unk24 = temp_r31->unk26 = REFRESH_RATE * 1.5;
                temp_r31->unk2C = -1;
                if (lbl_1_bss_16 <= 0) {
                    lbl_1_bss_18[lbl_1_bss_20++] = temp_r31->unk2;
                }
                Hu3DModelAttrReset(object->mdlId[1], HU3D_MOTATTR_SHAPE_PAUSE | HU3D_MOTATTR_PAUSE);
                Hu3DMotionSpeedSet(object->mdlId[1], 1.2f);
                Hu3DMotionShapeSpeedSet(object->mdlId[1], 1.2f);
                HuAudFXPlay(1986);
            }
            temp_r29 = 1;
            temp_r28 = HU3D_MOTATTR_LOOP;
            break;

        case 1:
            temp_r29 = 2;
            temp_r28 = HU3D_MOTATTR_NONE;
            if (!temp_r31->field0) {
                if (temp_r31->unk28 >= 0 && temp_r31->unk28 < 3) {
                    temp_r31->field0 = 1;
                    if (temp_r31->unk28 == 0) {
                        lbl_1_bss_30 = temp_r31->unk2;
                    }
                    temp_f31 = lbl_1_data_164[temp_r31->unk28];
                    Hu3DModelScaleSet(object->mdlId[4], temp_f31, temp_f31, temp_f31);
                    Hu3DModelAttrReset(object->mdlId[4], HU3D_ATTR_DISPOFF);
                }
            }
            temp_f31 = 1.0f - ((float)temp_r31->unk24 / temp_r31->unk26);
            sp24[0].x = temp_r31->unk4C.x;
            sp24[0].y = temp_r31->unk4C.y;
            sp24[0].z = temp_r31->unk4C.z;
            sp24[1].x = object->trans.x;
            sp24[1].y = object->trans.y + 1500;
            sp24[1].z = object->trans.z - 200;
            sp24[2].x = lbl_1_data_154[temp_r31->unk2];
            sp24[2].y = 0;
            sp24[2].z = 150;
            fn_1_24F0(sp24, &sp18, temp_f31);
            VECSubtract(&sp18, &Hu3DData[object->mdlId[4]].pos, &spC);
            Hu3DModelRotSet(object->mdlId[4], atan2d(-spC.y, VECMagXZ(&spC)), atan2d(spC.x, spC.z), 0);
            Hu3DModelPosSetV(object->mdlId[4], &sp18);
            if (sp18.y > 0.0f) {
                if (!temp_r31->field2 && temp_r31->field0) {
                    fn_1_6CB0(&sp18, -1);
                    fn_1_6698(&sp18, -1, -1, -1);
                    temp_r31->field2 = 1;
                }
            }
            temp_r31->unk34[0].x = temp_f31 * (2.0f * lbl_1_data_154[temp_r31->unk2]);
            temp_r31->unk34[0].y = -200.0f + (-400.0f * temp_f31);
            temp_r31->unk34[0].z = -500.0f + (-1500.0f * temp_f31);
            temp_r31->unk34[1].x = temp_f31 * lbl_1_data_154[temp_r31->unk2];
            temp_r31->unk34[1].y = -200.0f + (400.0f * temp_f31);
            temp_r31->unk34[1].z = -1000.0f + (750.0f * temp_f31);
            if (--temp_r31->unk24 == 0) {
                temp_r31->unk16 = 2;
                temp_r31->field1 = 1;
                if (temp_r31->field0) {
                    Hu3DModelAttrReset(object->mdlId[4], HU3D_MOTATTR_PAUSE);
                    Hu3DModelRotSet(object->mdlId[4], 0, 0, 0);
                    lbl_1_bss_14--;
                }
            }
            break;

