mariopartyrd/marioparty4/src/REL/m455Dll/main.c
        case 2:
            if (fn_1_320() == 7) {
                temp_r31->unk16 = 3;
                Hu3DModelObjPosGet(object->mdlId[0], "test11_tex_we-itemhook-r", &sp18);
                CharEffectSmokeCreate(1, &sp18);
                Hu3DModelAttrSet(object->mdlId[1], HU3D_ATTR_DISPOFF);
                Hu3DModelAttrSet(object->mdlId[3], HU3D_ATTR_DISPOFF);
            }
            break;

        case 3:
            if (fn_1_320() < 9) {
                temp_r29 = 0;
                temp_r28 = HU3D_MOTATTR_LOOP;
            }
            else {
                object->rot.y = fn_1_2390(object->rot.y, 0, 0.2f);
                if (temp_r31->unk2 == lbl_1_bss_30) {
                    temp_r29 = 3;
                    temp_r28 = HU3D_MOTATTR_NONE;
                }
                else {
                    temp_r29 = 4;
                    temp_r28 = HU3D_MOTATTR_NONE;
                }
            }
            break;

        default:
            break;
    }
    if (temp_r31->unk2C) {
        if (temp_r31->unk2C >= 0) {
            temp_f31 = (0.5 * sind((90.0f * (float)temp_r31->unk2C) / (float)temp_r31->unk2E)) + 0.5;
            espScaleSet(temp_r31->unk2A, temp_f31, temp_f31);
            if (--temp_r31->unk2C == 0) {
                temp_r31->unk2C = temp_r31->unk2E;
            }
            temp_r31->unk30++;
        }
        else {
            if (temp_r31->unk30 > REFRESH_RATE_F / 2) {
                espDispOff(temp_r31->unk2A);
                temp_r31->unk2C = 0;
            }
            else {
                temp_r31->unk30++;
            }
        }
    }
    if (temp_r31->unk16 >= 2 && temp_r31->unk16 <= 3 && temp_r31->field0) {
        Hu3DData[object->mdlId[4]].rot.y += 2.0f;
        if (0.0f == Hu3DData[object->mdlId[4]].motWork.time) {
            HuAudFXPlay(1987);
        }
    }
    if ((temp_r29 >= 0 && temp_r29 != temp_r31->unk1C) || temp_r28 != temp_r31->unk20) {
        temp_r31->unk1C = temp_r29;
        temp_r31->unk20 = temp_r28;
        CharMotionShiftSet(temp_r31->unk10, object->mtnId[temp_r31->unk1C], 0, 8, temp_r28);
    }
}

void fn_1_2010(OMOBJ *object)
{
    M455Player *player = object->data;
    if (object->data != NULL) {
        HuMemDirectFree(object->data);
        object->data = NULL;
    }
}

GXColor lbl_1_data_170 = { 255, 255, 255, 255 };

void fn_1_27A0(Vec *arg0, Vec *arg1, float arg2);

void fn_1_2060(HU3DMODEL *arg0, Mtx arg1)
{
    Vec vtxPos[4];
    Mtx mtxHook;

    Vec pos;
    Vec itemHookPos;
    s32 i;
    OMOBJ *object = arg0->hookData;
    M455Player *player = object->data;
    HU3DMODEL *modelPuku = &Hu3DData[object->mdlId[4]];
    GXLoadPosMtxImm(arg1, GX_PNMTX0);
    GXSetNumChans(1);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_REG, 0, GX_DF_CLAMP, GX_AF_NONE);
    GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_170);
    GXSetNumTexGens(0);
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
    GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
    GXSetAlphaCompare(GX_ALWAYS, 0, GX_AOP_AND, GX_ALWAYS, 0);
    GXSetNumTevStages(1);
    GXSetTevOp(GX_TEVSTAGE0, GX_PASSCLR);
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
    Hu3DModelObjMtxGet(object->mdlId[0], "test11_tex_we-itemhook-r", mtxHook);
    Hu3DModelObjPosGet(object->mdlId[1], "hook", &pos);
    MTXMultVec(mtxHook, &pos, &vtxPos[0]);
    for (i = 0; i < 2; i++) {
        vtxPos[i + 1].x = player->unk34[i].x;
        vtxPos[i + 1].y = player->unk34[i].y;
        vtxPos[i + 1].z = player->unk34[i].z;
    }
    if (player->field0) {
        Mtx hookMtx;
        Vec hookPos;
        Hu3DModelObjMtxGet(object->mdlId[4], "itemhook_C", hookMtx);
        hookPos.x = 0;
        hookPos.y = -60.000004f;
        hookPos.z = 35.0f;
        MTXMultVec(hookMtx, &hookPos, &vtxPos[3]);
    }
    else {
        vtxPos[3].x = modelPuku->pos.x;
        vtxPos[3].y = modelPuku->pos.y;
        vtxPos[3].z = modelPuku->pos.z;
    }
    GXBegin(GX_LINESTRIP, GX_VTXFMT0, 20);
    for (i = 0; i < 20; i++) {
        fn_1_27A0(vtxPos, &pos, i / 19.0f);
        GXPosition3f32(pos.x, pos.y, pos.z);
    }
    GXEnd();
}

float fn_1_2390(float arg0, float arg1, float arg2)
{
    float temp_f31 = fmod(arg1 - arg0, 360);
    float temp_f30;
    if (temp_f31 < 0) {
        temp_f31 += 360.0f;
    }
    if (temp_f31 > 180) {
        temp_f31 -= 360.0f;
    }
    temp_f30 = fmod(arg0 + (arg2 * temp_f31), 360);
    if (temp_f30 < 0) {
        temp_f30 += 360.0f;
    }
    return temp_f30;
}

float fn_1_2494(float arg0, float arg1, float arg2, float arg3)
{
    float temp_f31 = 1.0f - arg3;
    return (arg0 * (temp_f31 * temp_f31)) + ((2.0f * temp_f31) * arg3 * arg1) + (arg2 * (arg3 * arg3));
}

s32 fn_1_24F0(Vec *arg0, Vec *arg1, float arg2)
{
    arg1->x = fn_1_2494(arg0[0].x, arg0[1].x, arg0[2].x, arg2);
    arg1->y = fn_1_2494(arg0[0].y, arg0[1].y, arg0[2].y, arg2);
    arg1->z = fn_1_2494(arg0[0].z, arg0[1].z, arg0[2].z, arg2);
}

float fn_1_26F8(float arg0, float arg1, float arg2, float arg3, float arg4)
{
    float temp_f31 = 1.0f - arg0;
    float temp_f30 = temp_f31 * temp_f31;
    float temp_f29 = temp_f31 * temp_f31 * temp_f31;
    return (arg4 * (arg0 * (arg0 * arg0))) + ((arg3 * (arg0 * (3.0f * temp_f31 * arg0))) + ((temp_f29 * arg1) + (arg2 * (3.0f * temp_f30 * arg0))));
}

void fn_1_27A0(Vec *arg0, Vec *arg1, float arg2)
{
    arg1->x = fn_1_26F8(arg2, arg0[0].x, arg0[1].x, arg0[2].x, arg0[3].x);
    arg1->y = fn_1_26F8(arg2, arg0[0].y, arg0[1].y, arg0[2].y, arg0[3].y);
    arg1->z = fn_1_26F8(arg2, arg0[0].z, arg0[1].z, arg0[2].z, arg0[3].z);
}

float lbl_1_data_184[2] = {};

void fn_1_2AF4(s32 arg0, s32 arg1, float arg2);

void fn_1_2D44(OMOBJ *object);

void fn_1_2A90(HUPROCESS *objman)
{
    fn_1_2AF4(0, 0, 0);
    lbl_1_bss_40 = omAddObjEx(objman, 10, 0, 0, -1, fn_1_2D44);
}

void fn_1_2AF4(s32 arg0, s32 arg1, float arg2)
{
    CZoom = lbl_1_data_0[arg0].zoom + (arg2 * (lbl_1_data_0[arg1].zoom - lbl_1_data_0[arg0].zoom));
    Center.x = lbl_1_data_0[arg0].pos.x + (arg2 * (lbl_1_data_0[arg1].pos.x - lbl_1_data_0[arg0].pos.x));
    Center.y = lbl_1_data_0[arg0].pos.y + (arg2 * (lbl_1_data_0[arg1].pos.y - lbl_1_data_0[arg0].pos.y));
    Center.z = lbl_1_data_0[arg0].pos.z + (arg2 * (lbl_1_data_0[arg1].pos.z - lbl_1_data_0[arg0].pos.z));
    CRot.x = lbl_1_data_0[arg0].rot.x + (arg2 * (lbl_1_data_0[arg1].rot.x - lbl_1_data_0[arg0].rot.x));
    CRot.y = lbl_1_data_0[arg0].rot.y + (arg2 * (lbl_1_data_0[arg1].rot.y - lbl_1_data_0[arg0].rot.y));
    CRot.z = lbl_1_data_0[arg0].rot.z + (arg2 * (lbl_1_data_0[arg1].rot.z - lbl_1_data_0[arg0].rot.z));
}

void fn_1_2D44(OMOBJ *object)
{
    HU3DCAMERA *camera = &Hu3DCamera[0];
    switch (fn_1_320()) {
        case 1:
            fn_1_2AF4(0, 1, sind(lbl_1_data_184[0] * 90.0f));
            if (lbl_1_data_184[0] < 1.0f) {
                lbl_1_data_184[0] += REFRESH_FREQ;
                if (lbl_1_data_184[0] > 1.0f) {
                    lbl_1_data_184[0] = 1.0f;
                }
            }
            break;

        case 6:
            fn_1_2AF4(1, 1, 0);
            break;

        case 4:
        case 5:
        case 7:
            break;
    }
}

u32 lbl_1_data_18C[4] = { PAD_CHAN0_BIT, PAD_CHAN1_BIT, PAD_CHAN2_BIT, PAD_CHAN3_BIT };
s32 fn_1_3214(void)
{
    s32 rumble = HuPadRumbleGet();
    s32 i;
    for (i = 0; i < 4; i++) {
        if (!GWPlayerCfg[i].iscom) {
            if ((rumble & lbl_1_data_18C[GWPlayerCfg[i].pad_idx]) == 0) {
                return 0;
            }
        }
    }
    return GWGameStat.rumble;
}

float lbl_1_data_19C[] = { 0, 355, 0, 0, 0, 275, 128, 950, 6, 0, 0, 0, 190, 0, 550 };
